#--------------------------------------------------------------------------------------------------------------------------------
# 7. Реализовать проект «Операции с комплексными числами».
# Создайте класс «Комплексное число», реализуйте перегрузку методов сложения и умножения комплексных чисел.
# Проверьте работу проекта, создав экземпляры класса (комплексные числа) и выполнив сложение и умножение созданных экземпляров.
# Проверьте корректность полученного результата.
#--------------------------------------------------------------------------------------------------------------------------------
class ComplexNumber:

    __a : float = 0
    __b : float = 0
    __value : str = ''

    # --------------------------------------------------------------------------------------------------------------------------------
    def __init__(self, a, b):
        self.__a = a
        self.__b = b
        self.set_value()

    # --------------------------------------------------------------------------------------------------------------------------------
    def set_value(self):
        self.__value = f'{self.__a} + {self.__b}i'

    # --------------------------------------------------------------------------------------------------------------------------------
    def __str__(self):
        return self.__value

    # --------------------------------------------------------------------------------------------------------------------------------
    # (a + bi) ± (c + di) = (a ± c) + (b ± d)i
    def __add__(self, other):
        a = self.__a + other.__a
        b = self.__b + other.__b
        return ComplexNumber(a, b)

    # --------------------------------------------------------------------------------------------------------------------------------
    # (a + bi) ± (c + di) = (a ± c) + (b ± d)i
    def __sub__(self, other):
        a = self.__a - other.__a
        b = self.__b - other.__b
        return ComplexNumber(a, b)

    # --------------------------------------------------------------------------------------------------------------------------------
    # (a + bi) · (c + di) = (ac – bd) + (ad + bc)i
    def __mul__(self, other):
        a = (self.__a * other.__a) - (self.__b * other.__b)
        b = (self.__a * other.__b) + (self.__b * other.__a)
        return ComplexNumber(a, b)

# --------------------------------------------------------------------------------------------------------------------------------
# Основная программа
print('\nЗадание 3\n')

cn_1 = ComplexNumber(3, 6)
cn_2 = ComplexNumber(7, 8)

print('Число 1 =', cn_1)
print('Число 2 =', cn_2)
print()

print(f'Сложение:  ({cn_1}) + ({cn_2}) = ', cn_1 + cn_2)
# print(f'Вычитание: ({cn_1}) - ({cn_2}) = ', cn_1 - cn_2)
print(f'Умножение: ({cn_1}) * ({cn_2}) = ', cn_1 * cn_2)
