#--------------------------------------------------------------------------------------------------------------------------------
# 1. Реализовать класс «Дата», функция-конструктор которого должна принимать дату в виде строки формата «день-месяц-год».
# В рамках класса реализовать два метода.
# Первый, с декоратором @classmethod, должен извлекать число, месяц, год и преобразовывать их тип к типу «Число».
# Второй, с декоратором @staticmethod, должен проводить валидацию числа, месяца и года (например, месяц — от 1 до 12).
# Проверить работу полученной структуры на реальных данных.
#--------------------------------------------------------------------------------------------------------------------------------
class Date:
    date : str = ''

    # --------------------------------------------------------------------------------------------------------------------------------
    def __init__(self, date):
        Date.date = date

    # --------------------------------------------------------------------------------------------------------------------------------
    # получить год
    @classmethod
    def get_year(cls):
        return int(cls.date[-4:])

    # --------------------------------------------------------------------------------------------------------------------------------
    # получить месяц
    @classmethod
    def get_month(cls):
        return int(cls.date[3:5])

    # --------------------------------------------------------------------------------------------------------------------------------
    # получить день
    @classmethod
    def get_day(cls):
        return int(cls.date[:2])

    # --------------------------------------------------------------------------------------------------------------------------------
    # проверить дату 
    @staticmethod
    def valid_date(date):

        is_error = False
        day = date[:2]          # день
        month = date[3:5]       # месяц
        year = date[-4:]        # год
        text_error = ''

        # --------------------------------------------------------------------------------------------------------------------------------
        if (not day.isdigit()):                                                 # день
            is_error = True
            text_error = f'День ({day}) - не число!'

        elif (int(day) < 1) or (int(day) > 31):                                 # день
            is_error = True
            text_error = f'День ({day}) - не входит в диапазон 1..31!'

        # --------------------------------------------------------------------------------------------------------------------------------
        elif (not month.isdigit()):                                             # месяц
            is_error = True
            text_error = f'Месяц ({month}) - не число!'

        elif (int(month) < 1) or (int(month) > 12):                             # месяц
            is_error = True
            text_error = f'Месяц ({month}) - не входит в диапазон 1..12!'

        # --------------------------------------------------------------------------------------------------------------------------------
        elif (not year.isdigit()):                                             # год
            is_error = True
            text_error = f'День ({year}) - не число!'

        elif (int(year) < 2000) or (int(year) > 2100):                         # год
            is_error = True
            text_error = f'Год ({year}) - не входит в диапазон 2000..2100!'

        # --------------------------------------------------------------------------------------------------------------------------------
        if (is_error):
            result = f'Ошибка формата даты ({date})! ' + text_error
        else:
            result = f'Формат Даты ({date}) корректный!'

        return result

# --------------------------------------------------------------------------------------------------------------------------------
# Основная программа
print('\nЗадание 1\n')

sdate = '17-11-2019'
# dt_1 = date('17-05-2019')
print( 'Дата =', sdate)
print()
print( 'Год =', Date(sdate).get_year() )
print( 'Месяц =', Date(sdate).get_month() )
print( 'День =', Date(sdate).get_day() )

print()
print(Date.valid_date(sdate))
print(Date.valid_date('ab-11-2016'))
print(Date.valid_date('55-02-2010'))
print(Date.valid_date('21-66-2011'))
print(Date.valid_date('14-07-2200'))
print(Date.valid_date('14-07-2xx0'))
