#--------------------------------------------------------------------------------------------------------------------------------
# 2. Создайте собственный класс-исключение, обрабатывающий ситуацию деления на нуль.
# Проверьте его работу на данных, вводимых пользователем.
# При вводе пользователем нуля в качестве делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.

# --------------------------------------------------------------------------------------------------------------------------------
class MyExceptionDivisionByZero(Exception):

    def __init__(self, text = ''):
        self.text = text

# --------------------------------------------------------------------------------------------------------------------------------
# Основная программа
print('\nЗадание 2\n')

stop_input = False
result = 0
while not stop_input:

    a = input('Введите число - делимое:  ')
    b = input('Введите число - делитель: ')

    try:
        if (float(b) == 0):
            err_text = f'Ошибка MyExceptionDivisionByZero: Деление на ноль: {a} / {b}'
            raise MyExceptionDivisionByZero(err_text)

        print('Результат =', float(a) / float(b))

    except MyExceptionDivisionByZero as err:
        print(err)

    except:
        print('Прочие ошибки')

    is_stop = input('\nЗакончить ввод? Y/N: ')
    if (is_stop.upper() == 'Y'):
        stop_input = True
        print('Конец!')
    else:
        print('Продолжаем...\n')
