#--------------------------------------------------------------------------------------------------------------------------------
# 3. Реализовать функцию my_funcc(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
def my_func(a, b, c):
    return sum([a, b, c]) - min([a, b, c])

print( '3, 8, 2 =>',        my_func(3, 8, 2))
print( '8, 8, 8 =>',        my_func(8, 8, 8))
print( '-5, -8, -10 =>',    my_func(-5, -8, -10))