#--------------------------------------------------------------------------------------------------------------------------------
# 1. Создать программно файл в текстовом формате, записать в него построчно данные, вводимые пользователем.
# Об окончании ввода данных свидетельствует пустая строка.

print('\nЗадание 1\n')

with open('Task_01.txt', 'w', encoding = 'utf-8') as file:
    line_index = 0
    is_stop = False

    while not is_stop:

        line_index += 1
        str_file = input(f'Введите строку {line_index}: ')

        if (len(str_file) == 0):
            is_stop = True
        else:
            file.write(f'{str_file}\n')

print('Завершение ввода')