#--------------------------------------------------------------------------------------------------------------------------------
# 5. Реализовать класс Stationery (канцелярская принадлежность).
# Определить в нем атрибут title (название) и метод draw (отрисовка).
# Метод выводит сообщение “Запуск отрисовки.”
# Создать три дочерних класса Pen (ручка), Pencil (карандаш), Handle (маркер).
# В каждом из классов реализовать переопределение метода draw.
# Для каждого из классов методы должен выводить уникальное сообщение.
# Создать экземпляры классов и проверить, что выведет описанный метод для каждого экземпляра.

# --------------------------------------------------------------------------------------------------------------------------------
class Stationary:

    title: str = ''

    def __init__(self, title = 'Шаблон'):
        self.title = title

    def draw(self):
        print('\tЗапуск отрисовки...')

# --------------------------------------------------------------------------------------------------------------------------------
class Pen(Stationary):

    def __init__(self, title = 'Ручка'):
        self.title = title

    def draw(self):
        print(f'\t{self.title} - Запуск отрисовки...\tЭто рисует Ручка, Ручка, Ручка...')

#--------------------------------------------------------------------------------------------------------------------------------
class Pencil(Stationary):

    def __init__(self, title = 'Карандаш'):
        self.title = title

    def draw(self):
        print(f'\t{self.title} - Запуск отрисовки...\tЭто рисует Карандаш, Карандаш, Карандаш...')

#--------------------------------------------------------------------------------------------------------------------------------
class Handle(Stationary):

    def __init__(self, title = 'Маркер'):
        self.title = title

    def draw(self):
        print(f'\t{self.title} - Запуск отрисовки...\tЭто рисует Маркер, Маркер, Маркер...')

#--------------------------------------------------------------------------------------------------------------------------------
# Основная программа
print('\nЗадание 5')

st_1 = Stationary()
st_2 = Pen()
st_3 = Pencil()
st_4 = Handle()

print('\nСписок объектов:')
print('\t', st_1.title, st_2.title, st_3.title, st_4.title)

print('\nМетоды отрисовки объектов:')
st_1.draw()
st_2.draw()
st_3.draw()
st_4.draw()

