#--------------------------------------------------------------------------------------------------------------------------------
# 2. Реализовать класс Road (дорога), в котором определить атрибуты:
# length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом, толщиной в 1 см * число см толщины полотна.
# Проверить работу метода.
# Например: 20м*5000м*25кг*5см = 12500 т

class Road:
    _length: int = 0       # длина дороги; метры
    _width:  int = 0       # ширина дороги; метры

    _height:        int   = 0       # высота полотна; см
    _weight_m2:     int   = 0       # масса 1 м2 полотна высотой 1 см; кг
    _weight_total:  float = 0       # общая масса асфальта для покрытия дороги; тонны

    # --------------------------------------------------------------------------------------------------------------
    # параметры: length (м); width (м); heigh (см), weight_m2 (кг)
    def __init__(self, length, width, height = 0, weight_m2 = 0):

        self._length = length
        self._width = width
        self._height = height
        self._weight_m2 = weight_m2

    # --------------------------------------------------------------------------------------------------------------
    # вычисление общей массы асфальта для покрытия всей дороги; параметры: height (см); weight_m2 (кг)
    # результат в тоннах
    def calc_total_weight(self, height, weight_m2):

        self._height = height
        self._weight_m2 = weight_m2
        self._weight_total = self._length * self._width * self._height * self._weight_m2 / 1000

        return self._weight_total

    # --------------------------------------------------------------------------------------------------------------
    # метод получения длины дороги
    def get_length(self):
        return self._length

    # --------------------------------------------------------------------------------------------------------------
    # метод получения ширины дороги
    def get_width(self):
        return self._width

    # --------------------------------------------------------------------------------------------------------------
    # метод получения выстоы полотна
    def get_height(self):
        return self._height

    # --------------------------------------------------------------------------------------------------------------
    # метод получения массы 1 м2 полотна
    def get_weight_m2(self):
        return self._weight_m2

    # --------------------------------------------------------------------------------------------------------------
    # получения общей массы асфальта
    def get_weight_total(self):
        return self._weight_total

#-------------------------------------------------------------------------------------------------------------------
# Основная программа
print('\nЗадание 2\n')

rd = Road(5000, 20)
rd.calc_total_weight(5, 25)

print(f'Длина дороги         = {rd.get_length()} м')
print(f'Ширина дороги        = {rd.get_width()} м')
print(f'Высота полотна       = {rd.get_height()} см')
print(f'Масса 1 м2 полотна   = {rd.get_weight_m2()} кг')

print(f'Масса всего асфальта = {rd.get_weight_total()} тонн')




