#--------------------------------------------------------------------------------------------------------------------------------
# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
print('\nЗадание 1\n')

my_var1 = 1000
my_var2 = 3.14159
my_var3 = 'Hello, world!'
my_var4 = True

print(f'my_var1 = {my_var1}\nmy_var2 = {my_var2}\nmy_var3 = {my_var3}\nmy_var4 = {my_var4}')

first_name  = input('\nВведите Имя: ')
second_name = input('Введите Фамилию: ')
age         = input('Введите возраст: ')

print(f'\nВы ввели:\n   Имя: {first_name}\n   Фамилия: {second_name}\n   Возраст: {age}')

