#--------------------------------------------------------------------------------------------------------------------------------
# 6. Реализовать два небольших скрипта:
# а) бесконечный итератор, генерирующий целые числа, начиная с указанного,
# б) бесконечный итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.

from itertools import count, cycle
import time

script_number = input('Введите номер скрипта:'
             '\n\t1 - бесконечный итератор, генерирующий целые числа, начиная с указанного'
             '\n\t2 - бесконечный итератор, повторяющий элементы некоторого списка'
             '\n\t: ')

#--------------------------------------------------------------------------------------------------------------------------------
if (script_number == '1'):

    print('Задание 6.а')

    first_number = ''
    while not first_number.isdigit():
        first_number = input('Введите целое число - начало бесконечного цикла: ')

    first_number = int(first_number)

    for i in count(first_number):
        print(i)
        time.sleep(0.1)

#--------------------------------------------------------------------------------------------------------------------------------
else:
    print('Задание 6.б')

    list_words = ['20%', 'усилий', 'приносят', '80%', 'результата']
    print('Исходный список = ', list_words)

    for item in cycle(list_words):
        print(item)
        time.sleep(0.3)

